src/bsl/Catalogs/гкс_АлгоритмыРасчетаПоказателейКачестваНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>гкс_АлгоритмыРасчетаПоказателейКачестваНоменклатуры</Name>
			<Comment>ERP-1537</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответсвенный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеРегистрироватьУслугиСНулевойСтоимостью</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Скидки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гкс_ПоказателиАнализовНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Натуральная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Денежная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭтоСкидкаНадбавка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбрастьПримененияСкидкиНадбавки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипВеса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидУслуги</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/bsl/Catalogs/гкс_АлгоритмыРасчетаПоказателейКачестваНоменклатуры/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 ЗаполнитьВспомогательныеДанныеДляКонструктораФормул();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСкидки

&НаКлиенте
Процедура СкидкиФормулаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ИмяТаблицы", "Скидки");
  	ОписаниеОповещения = Новый ОписаниеОповещения("ПриЗавершенииРедактированияФормулы", ЭтотОбъект, ПараметрыОповещения);
  	
  	КонструкторФормулКлиент.НачатьРедактированиеФормулы(ПараметрыФормулы(Элемент.ТекстРедактирования), ОписаниеОповещения);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиФормулаОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ИмяТаблицы", "Услуги");
  	ОписаниеОповещения = Новый ОписаниеОповещения("ПриЗавершенииРедактированияФормулы", ЭтотОбъект, ПараметрыОповещения);
  	
  	КонструкторФормулКлиент.НачатьРедактированиеФормулы(ПараметрыФормулы(Элемент.ТекстРедактирования), ОписаниеОповещения);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьВспомогательныеДанныеДляКонструктораФормул()
	
	АдресХранилищаДереваОперандов = СформироватьДеревоОперандов();
	АдресХранилищаДереваОператоров = СформироватьДеревоОператоров(); 
	
КонецПроцедуры
  
&НаСервере
Функция СформироватьДеревоОперандов()
	
	МенеджерОбъекта = Справочники.гкс_АлгоритмыРасчетаПоказателейКачестваНоменклатуры; 
	Возврат МенеджерОбъекта.СформироватьДеревоОперандов(УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Функция СформироватьДеревоОператоров()
	
	МенеджерОбъекта = Справочники.гкс_АлгоритмыРасчетаПоказателейКачестваНоменклатуры; 
	Возврат МенеджерОбъекта.СформироватьДеревоОператоров(УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Функция ПараметрыФормулы(ФормулаСтрока)
	СтруктураПараметров = КонструкторФормулКлиент.ПараметрыРедактированияФормулы();
	СтруктураПараметров.Формула		= ФормулаСтрока;
	СтруктураПараметров.Операнды	= АдресХранилищаДереваОперандов;
	СтруктураПараметров.Операторы	= АдресХранилищаДереваОператоров;
	
	Возврат СтруктураПараметров;
КонецФункции

#Область ОбратныеВызовы

&НаКлиенте
Процедура ПриЗавершенииРедактированияФормулы(ОписаниеФормулы, ДопПараметры) Экспорт
	Если ОписаниеФормулы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИмяТаблицыФормы = ДопПараметры["ИмяТаблицы"];
	Элементы[ИмяТаблицыФормы].ТекущиеДанные.Формула = ОписаниеФормулы.Формула;
	Элементы[ИмяТаблицыФормы].ТекущиеДанные.ФормулаПредставление = ОписаниеФормулы.ПредставлениеФормулы;
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#КонецОбласти
